cf/DataProcessors/_DemoShowUserMessages.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>_DemoShowUserMessages</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ObjectAttribute</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/Documents/_DemoCustomerProformaInvoice.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>_DemoCustomerProformaInvoice</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister._DemoProformaInvoicesTurnovers</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoBankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DiscountMarkupType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PayDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCounterpartiesContracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Basis</Name>
					<Comment>Foundation document</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef._DemoSalesOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceListColumn</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Partner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoPartners</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCounterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Repetition</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Rate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Organization</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoCompanies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmployeeResponsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._DemoDepartments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PriceList</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PayPercentage</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AmountIncludesVAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PayAmount</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.MonetaryAmountNonNegative</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Goods</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Products</Name>
							<Comment>Products</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef._DemoProducts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Characteristic</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._DemoCharacteristics</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Count</Name>
							<Comment>Count</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Comment>Price</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.MonetaryAmountNonNegative</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Sum</Name>
							<Comment>Sum</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.MonetaryAmountNonNegative</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>VATAmount</Name>
							<Comment>amount of VAT</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.MonetaryAmountNonNegative</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Total</Name>
							<Comment>Total</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.MonetaryAmountNonNegative</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Comment>Property</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Comment>Value</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/DataProcessors/_DemoShowUserMessages/Forms/Form/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//
//

#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Object.ObjectAttribute = NStr("ru = 'Тестовое значение реквизита';
									|en = 'Test attribute value';");
	
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure ShowMessageForFormFieldLinkedToObjectAttributeAtClient(Command)
	
	CommonClient.MessageToUser(
		StringFunctionsClientServer.SubstituteParametersToString(
			NStr("ru = 'Пример сообщения, связанного с реквизитом объекта (%1).';
				|en = 'Sample of a message connected to an object attribute (%1).';"), "Object.ObjectAttribute"), ,
		"ObjectAttribute", "Object");
	
EndProcedure

&AtClient
Procedure ShowMessageForFormFieldLinkedToObjectAttributeAtServer(Command)
	
	ShowMessageForFormFieldLinkedToObjectAttributeServer();
	
EndProcedure

&AtClient
Procedure ViewCodeOptionOne(Command)
	
	OpenForm("DataProcessor._DemoShowUserMessages.Form.CodeExample",
		New Structure("CodeExample", "Common.MessageToUser(
		|	NStr(""ru = 'Sample messages related From1 attribute5 object_.'""),
		|	,
		|	""ObjectAttribute"",
		|	""Object"");"));
	
EndProcedure

&AtClient
Procedure ShowMessageForFormFieldLinkedToFormAttributeAtClient(Command)
	
	CommonClient.MessageToUser(
		StringFunctionsClientServer.SubstituteParametersToString(
			NStr("ru = 'Пример сообщения, связанного с реквизитом формы (%1).';
				|en = 'Sample of a message connected to a form attribute (%1).';"), "FormAttribute"), ,
			"FormAttribute");
	
EndProcedure

&AtClient
Procedure ShowMessageForFormFieldLinkedToFormAttributeAtServer(Command)
	
	ShowMessageForFormFieldLinkedToFormAttributeServer();
	
EndProcedure

&AtClient
Procedure ViewCodeOptionTwo(Command)
	
	OpenForm("DataProcessor._DemoShowUserMessages.Form.CodeExample",
		New Structure("CodeExample", "Common.MessageToUser(
		|	NStr(""ru = 'Sample messages, related From1 attribute5 forms (FormAttribute).'""),
		|	,
		|	""FormAttribute"");"));
		
EndProcedure

&AtClient
Procedure ShowMessageAssociatedWithInfobaseObjectAttribute(Command)
	
	If Not ShowInfobaseObjectAttributeMessageServer() Then
		NotifyDescription = New NotifyDescription("ShowMessageAssociatedWithInfobaseObjectAttributeCompletion", ThisObject);
		ShowMessageBox(NotifyDescription, NStr("ru = 'Для выполнения теста предварительно создайте хотя бы один документ ""Демо: Счет на оплату покупателю"".';
														|en = 'To run a test, create at least one ""Demo: Sales proforma invoice document"" in advance.';"));
	EndIf;
	
EndProcedure

&AtClient
Procedure ViewCodeOptionThree(Command)
	
	OpenForm("DataProcessor._DemoShowUserMessages.Form.CodeExample",
		New Structure("CodeExample", "Common.MessageToUser(
		|	NStr(""ru = 'Sample messages, related From1 attribute5 ""EmployeeResponsible"" document_ ""Demo: Account to1 payment_0 tobuyer"" 
				|(object information bases).'""),
		|	Ref.GetObject(),
		|	""EmployeeResponsible"");"));
	
EndProcedure

&AtClient
Procedure ShowMessageAssociatedWithInfobaseObjectAttributeByRefAtClient(Command)
	
	Var ResultIsEmpty;
	
	Ref = GetRef(ResultIsEmpty);
	
	If ResultIsEmpty Then
		ShowMessageBox(, NStr("ru = 'Не найдено доступных объектов.';
										|en = 'Available objects are not found.';"));
		Return;
	EndIf;
	
	CommonClient.MessageToUser(
		NStr("ru = 'Пример сообщения, связанного с реквизитом ""Ответственный"" документа ""Демо: Счет на оплату покупателю""
			| (объект информационной базы).';
			|en = 'Sample of a message connected to the ""Person responsible"" attribute of the ""Demo: Sales proforma invoice"" document
			|(an infobase object).';"),
		Ref,
		"EmployeeResponsible");
	
	Return;
	
EndProcedure

&AtClient
Procedure ShowMessageAssociatedWithInfobaseObjectAttributeByRefAtServer(Command)
	
	If Not ShowMessageLinkedToInfobaseObjectAttributeByRefServer() Then
		NotifyDescription = New NotifyDescription("ShowMessageAssociatedWithInfobaseObjectAttributeByRefAtServerCompletion", ThisObject);
		ShowMessageBox(NotifyDescription, NStr("ru = 'Для выполнения теста предварительно создайте хотя бы один документ ""Демо: Счет на оплату покупателю"".';
														|en = 'To run a test, create at least one ""Demo: Sales proforma invoice document"" in advance.';"));
	EndIf;
	
EndProcedure

&AtClient
Procedure ViewCodeOptionFour(Command)
	
	OpenForm("DataProcessor._DemoShowUserMessages.Form.CodeExample",
		New Structure("CodeExample", "Common.MessageToUser(
		|	NStr(""ru = 'Test1 message turn oferror, related1 From1 attribute5 ""EmployeeResponsible"" document_ ""Demo: Account to1 payment_0 tobuyer""
				|(ref to1 object).'""),
		|	Ref,
		|	""EmployeeResponsible"")"));
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure ShowMessageForFormFieldLinkedToObjectAttributeServer()
	
	Common.MessageToUser(
		StringFunctionsClientServer.SubstituteParametersToString(
			NStr("ru = 'Пример сообщения, связанного с реквизитом объекта (%1).';
				|en = 'Sample of a message connected to an object attribute (%1).';"), "Object.ObjectAttribute"), ,
		"ObjectAttribute",
		"Object");
	
EndProcedure

&AtServer
Procedure ShowMessageForFormFieldLinkedToFormAttributeServer()
	
	Common.MessageToUser(
		StringFunctionsClientServer.SubstituteParametersToString(
			NStr("ru = 'Пример сообщения, связанного с реквизитом формы (%1).';
				|en = 'Sample of a message connected to a form attribute (%1).';"), "FormAttribute"), ,
		"FormAttribute");
	
EndProcedure

&AtClient
Procedure ShowMessageAssociatedWithInfobaseObjectAttributeCompletion(AdditionalParameters) Export
	
	OpenForm("Document._DemoCustomerProformaInvoice.ListForm");
	
EndProcedure

&AtServer
Function ShowInfobaseObjectAttributeMessageServer()
	
	Var ResultIsEmpty;
	Ref = GetRef(ResultIsEmpty);
	If ResultIsEmpty Then
		Return False;
	EndIf;
	
	Common.MessageToUser(
		NStr("ru = 'Пример сообщения, связанного с реквизитом ""Ответственный"" документа ""Демо: Счет на оплату покупателю"" 
			| (объект информационной базы).';
			|en = 'Sample of a message connected to the ""Person responsible"" attribute of the ""Demo: Sales proforma invoice"" document
			|(an infobase object).';"),
		Ref.GetObject(), "EmployeeResponsible");
	Return True;
	
EndFunction

&AtClient
Procedure ShowMessageAssociatedWithInfobaseObjectAttributeByRefAtServerCompletion(AdditionalParameters) Export
	
	OpenForm("Document._DemoCustomerProformaInvoice.ListForm");
	
EndProcedure

&AtServer
Function ShowMessageLinkedToInfobaseObjectAttributeByRefServer()
	
	Var ResultIsEmpty;
	
	Ref = GetRef(ResultIsEmpty);
	
	If ResultIsEmpty Then
		Return False;
	EndIf;
	
	Common.MessageToUser(
		NStr("ru = 'Пример сообщения, связанного с реквизитом ""Ответственный"" документа ""Демо: Счет на оплату покупателю""
			| (ссылка на объект).';
			|en = 'Sample of a message connected to the ""Person responsible"" attribute of the ""Demo: Sales proforma invoice"" document
			|(object reference).';"),
		Ref,
		"EmployeeResponsible");
	
	Return True;
	
EndFunction

&AtServerNoContext
Function GetRef(ResultIsEmpty)
	
	QueryText = 
		"SELECT ALLOWED TOP 1
		|	_DemoCustomerProformaInvoice.Ref AS Ref
		|FROM
		|	Document._DemoCustomerProformaInvoice AS _DemoCustomerProformaInvoice";
	
	Query = New Query;
	Query.Text = QueryText;
	Result = Query.Execute();
	
	If Result.IsEmpty() Then
		ResultIsEmpty = True;
		Return Documents._DemoCustomerProformaInvoice.EmptyRef();
	EndIf;
	
	ResultIsEmpty = False;
	Return Result.Unload()[0].Ref
	
EndFunction

#EndRegion
